{
    "version": "https://jsonfeed.org/version/1",
    "title": "Monosi Documentation Blog",
    "home_page_url": "https://docs.monosi.dev/changelog",
    "description": "Monosi Documentation Blog",
    "items": [
        {
            "id": "latest-release",
            "content_html": "<p>Monosi v0.1.0 Release</p><hr/><p>Monosi&#x27;s v0.1.0 release brings a new UI, ease of use &amp; deployment, and much more.</p><h3>Web Application &amp; UI</h3><p>In order to use the Monosi application, a web frontend and server are provided to add data sources, receive alerts, and view data quality analysis of the monitors that are running.</p><img alt=\"Monosi Release\" class=\"case-study-header\" src=\"/img/example.gif\"/><h2>Automatic Scheduler</h2><p>Built-in scheduling is provided out of the box with Monosi so that you can set it and forget it - until you receive an alert - or choose to view regularly up-to-date data at any time.</p><h2>Profiler</h2><p>Built-in profiling allows for the automatic creation of data monitors and quality checks when a data source is added.</p><h3>Deployment</h3><p>Deploying has been simplified with Docker and Docker Compose. All the necessary dependencies for Monosi to run are managed through Docker Compose, making it easy to start with just 3 commands:</p><pre><code>git clone https://github.com/monosidev/monosi.git\ncd monosi\nmake compose\n</code></pre><h2>Integration Support</h2><p>Support for Snowflake, PostgreSQL, and Redshift has been added. </p><p>You can also receive alerts via webhooks and Slack.</p><h3>Documentation</h3><p>Documentation has been added to the project and is available at <a href=\"https://docs.monosi.dev\">https://docs.monosi.dev</a></p><h3>Testing &amp; Bug fixes</h3><p>More tests have been added to ensure the reliability of the code. Furthermore, bug fixes and code changes have been made to make Monosi increasingly more stable.</p>",
            "url": "https://docs.monosi.dev/changelog/latest-release",
            "title": "v0.1.0 Release",
            "summary": "Monosi v0.1.0 Release",
            "date_modified": "2022-04-01T00:00:00.000Z",
            "author": {
                "name": "Kevin Unkrich"
            }
        }
    ]
}